// Get all sections with the 'clickable-section' class
const clickableSections = document.querySelectorAll('.clickable-section');

// Function to change text on click
function changeText(event) {
    const section = event.currentTarget; // Get the clicked section

    // Define different texts for each section (modify as needed)
    const texts = [
        "Як правильно вжито розділові знаки у реченні: \"Спробуй ще раз сказав вчитель і пиши чітко\"?\n" +
        "а) \"Спробуй ще раз сказав вчитель і пиши чітко.\" \n" +
        "б) \"Спробуй ще раз сказав вчитель і, пиши чітко.\" \n" +
        "в) \"Спробуй ще раз сказав вчитель і пиши, чітко. \"\n" +
        "г) \"Спробуй ще раз, сказав вчитель, і пиши чітко.\"",
        "Як правильно вжито розділові знаки у реченні: \"Пряма мова - це коли інформація подається просто і чітко\"?\n" +
        "а) \"Пряма мова, це коли інформація подається, просто і чітко.\" \n" +
        "б) \"Пряма мова - це, коли інформація подається просто і чітко.\" \n" +
        "в) \"Пряма мова - це коли, інформація подається просто і чітко.\" \n" +
        "г) \"Пряма мова - це коли інформація подається просто, і чітко.\"",
        "Як правильно вжито розділові знаки у реченні: \"Дівчата хочете щоб я розповів історію про те як я подолав свої страхи\"?\n" +
        "а) \"Дівчата, хочете щоб я розповів історію про те, як я подолав свої страхи?\" \n" +
        "б) \"Дівчата хочете, щоб я розповів історію про те, як я подолав свої страхи?\" \n" +
        "в) \"Дівчата, хочете щоб я розповів, історію про те, як я подолав свої страхи?\" \n" +
        "г) \"Дівчата, хочете, щоб я розповів історію про те, як я подолав свої страхи?",
        "Як правильно вжито розділові знаки у реченні: \"Пряма мова відома своєю простотою, активністю і чіткістю\"?\n" +
        "а) \"Пряма мова відома своєю простотою активністю і чіткістю.\" \n" +
        "б) \"Пряма мова відома своєю простотою, активністю і чіткістю.\" \n" +
        "в) \"Пряма мова відома, своєю простотою, активністю, і чіткістю. \"\n" +
        "г) \"Пряма мова відома, своєю простотою, активністю і чіткістю.\"",
        "Як правильно вжито розділові знаки у реченні: \"Вона сказала Поїдемо друзі! і посміхнулася\"?\n" +
        "а) \"Вона сказала: Поїдемо, друзі! і посміхнулася.\" \n" +
        "б) \"Вона сказала, Поїдемо, друзі! і посміхнулася.\" \n" +
        "в) \"Вона сказала: 'Поїдемо, друзі!' і посміхнулася.\" \n" +
        "г) \"Вона сказала, 'Поїдемо, друзі!' і посміхнулася.\"",
        "Як правильно вжито розділові знаки у реченні: \"Прошу вас підказати де можна знайти цю книгу\"?\n" +
        "а) \"Прошу вас підказати, де можна знайти цю книгу?\" \n" +
        "б) \"Прошу вас, підказати, де можна знайти цю книгу.\" \n" +
        "в) \"Прошу вас підказати де можна, знайти цю книгу?\" \n" +
        "г) \"Прошу вас, підказати де можна, знайти цю книгу.\"",
        "Як правильно вжито розділові знаки у реченні: \"Читайте думайте пишіть\"?\n" +
        "а) \"Читайте, думайте пишіть.\" \n" +
        "б) \"Читайте думайте, пишіть.\" \n" +
        "в) \"Читайте думайте, пишіть.\"\n" +
        "г) \"Читайте, думайте, пишіть.",
        "Як правильно вжито розділові знаки у реченні: \"Вітаю вас шановні гості, з новим роком!\"?\n" +
        "а) \"Вітаю вас, шановні гості, з новим роком!\" \n" +
        "б) \"Вітаю вас, шановні гості, з новим, роком!\" \n" +
        "в) \"Вітаю вас, шановні гості з новим роком!\" \n" +
        "г) \"Вітаю вас шановні гості, з новим роком!\"",
        "Як правильно вжито розділові знаки у реченні: \"Мама попросила мене приготувати обід і я почав готувати\"?\n" +
        "а) \"Мама попросила мене приготувати обід і я почав готувати.\" \n" +
        "б) \"Мама попросила мене, приготувати обід і я почав готувати.\" \n" +
        "в) \"Мама попросила мене приготувати обід, і я почав готувати.\" \n" +
        "г) \"Мама, попросила мене приготувати обід, і я почав готувати.\"",
        "Як правильно вжито розділові знаки у реченні: \"Поспішай щоб встигнути на автобус \"сказала мати?\n" +
        "а) \"Поспішай ,щоб встигнути на автобус \"— сказала мати. \n" +
        "б) \"Поспішай щоб встигнути на автобус, \" сказала мати. \n" +
        "в) \"Поспішай, щоб встигнути на автобус, \" — сказала мати. \n" +
        "г) \"Поспішай, щоб встигнути, на автобус\" — сказала мати.",
        "Як правильно вжито розділові знаки у реченні: \"Друзі не забудьте завтра прийти на нашу вечірку!\"?\n" +
        "а) \"Друзі, не забудьте завтра, прийти на нашу вечірку!\" \n" +
        "б) \"Друзі не забудьте завтра, прийти на нашу вечірку!\" \n" +
        "в) \"Друзі не забудьте завтра прийти на нашу вечірку! \"\n" +
        "г) \"Друзі, не забудьте завтра прийти на нашу вечірку!",
        "Як правильно вжито розділові знаки у реченні: \"Вчора був сонячний день і ми пішли на прогулянку\"?\n" +
        "а) \"Вчора був сонячний день і ми пішли на прогулянку.\" \n" +
        "б) \"Вчора був сонячний день, і, ми пішли на прогулянку. \"\n" +
        "в) \"Вчора був сонячний день, і ми пішли на прогулянку.\" \n" +
        "г) \"Вчора був сонячний день і ми, пішли на прогулянку.\"",
        "1 г\n" +
        "2 б\n" +
        "3 а\n" +
        "4 б\n" +
        "5 в\n" +
        "6 а\n" +
        "7 г\n" +
        "8 а\n" +
        "9 в\n" +
        "10 а\n" +
        "11 г\n" +
        "12 в",
    ];

    // Get the index of the clicked section
    const sectionIndex = Array.from(clickableSections).indexOf(section);

    // Change the text in the clicked section
    section.querySelector('p').textContent = texts[sectionIndex];

    // Check if all sections have been clicked, then display "INTERESTING"
    if (texts.every(text => text !== "Click to change the text.")) {
        document.getElementById("result").textContent = "INTERESTING";
    }
}

// Add click event listener to each clickable section
clickableSections.forEach((section) => {
    section.addEventListener('click', changeText);
});